In [1]:
import pandas as pd
from data_profiler import DataProfiler

In [4]:
df1 = pd.read_csv('mock_data.csv')

In [20]:
df1

   ID           Name    Age          Company   Salary    JoinDate
0   1       John Doe   28.0         TechCorp  50000.0  2022-01-15
1   2     Jane Smith   34.0      InnovateInc  75000.0  2021-06-20
2   3  Alice Johnson   29.0         TechCorp  55000.0  2023-03-10
3   4      Bob Brown    NaN      InnovateInc  60000.0  2020-11-05
4   5  Charlie Davis   45.0  FutureSolutions  90000.0  2019-08-12
5   6       John Doe   28.0         TechCorp  52000.0  2022-01-15
6   7            NaN   31.0  FutureSolutions      NaN  2021-09-30
7   8   Frank Wilson  120.0         TechCorp  48000.0  2023-05-21
8   9      Grace Lee   26.0       WebSystems    100.0  2024-01-01
9  10    Henry White   38.0              NaN  85000.0  2018-12-12

In [5]:
df2 = df1.copy()
df2['Salary'] = df2['Salary'] * 1.1 
df2['JoinDate'] = pd.to_datetime(df2['JoinDate'])

In [6]:
# Initialize Profiler
profiler = DataProfiler([df1, df2])

In [21]:
config = {
    # Run on ALL columns
    "check_nulls": {"columns":['ID']}
}
results = profiler.run_checks(check_config=config)

Custom Checks

In [22]:
results['dataset_0']

        nulls_null_count
Salary                 1
ID                     0